import React, { Component } from "react";
import Layout from '../shared/Layout';
import LibraryWidget from '../Widgets/LibraryWidget';
import AudioWidget from '../Widgets/AudioWidget';

class DefinitionofSheikh extends Component {
  constructor(props) {
    super(props);
  }

  render() {

    return (
      <Layout>
        <div className="title-container">
            <h1> Definition of Sheikh  </h1>
      </div>
      <div class="wrapper">      
          <div className="left-list">
            <LibraryWidget></LibraryWidget>
            <AudioWidget></AudioWidget>
          </div>
          <div className="right-list">         
            <div class="article-container"> 
            <h1> تعريف بالشيخ	 </h1>
                <p>
                بسم الله الرحمن الرحيم ..

الحمد لله القائل في كتابه العزيز : ( مِنَ المؤمنين رجالٌ صَدَقوا ما عاهدوا الله عليه فمنهم مَنْ قضى نَحْبه ومنهم مَنْ ينتظر وما بدّلوا تبديلاً ) .
والصلاة والسلام على تاج الأنبياء والمرسلين سيدنا محمد ، وعلى آله الطاهرين ، وأصحابه الغُرّ الميامين ، ومَنِ اقتفى أثرهم واهتدى بهديهم إلى يوم الدين ..
وبعدُ ..

إنَّ الله تعالى جعل الإسلام خاتم الأديان ، وجعل أتباعه المسلمين الصادقين منصورين إلى يوم القيامة أينما حلّوا وأينما وُجِدوا ، وكلّل أعمالهم بالعناية والتوفيق ، وجعلهم نوراً للقلوب والمجتمعات ، يهدي بهم مَنْ يريد الهداية ، ومَن يريد شاطئ السلام .
فسيدنا الشيخ محمد عيد عبد الله يعقوب الحسيني الشافعي المذهب ، الأشعري العقيدة ، النقشبندي الطريقة ، هو عَلَم مِن أعلام الإسلام ، وسيّد مِن علماء الشريعة والحقيقة ، أخلص لله تعالى ورضع من آداب القرآن والسنة النبوية ، فكان عبداً حقيقياً لله تعالى ، وقرآناً ناطقاً تتلألأ فيه المعرفة الإلهية التي لا يغيب إشراقها ، ولا يُحصر بهاؤها عن مبصِر .
هو سليل آل بيت النبي المصطفى صلى الله عليه وسلم مِنَ الطرفين ، فأبوه حسيني وأمه حسنية .
ولد في صبيحة يوم الأربعاء العاشر من ذي الحجة سنة 1354هـ ، الموافق الرابع من آذار( مارس ) سنة 1936م ، والناس يكبّرون لصلاة عيد الأضحى المبارك ؛ فسُمِّي لذلك عيداً ، وسمي بمحمد تبركاً بالنبي صلى الله عليه وسلم .
مسقط رأسه هي حارة الجامع الأحمر من بلدة صفد شمال فلسطين ، حيث هناك نشأ النشأة الإسلامية بين أبوين صالحين وجدة تقية ، كانوا يحبونه حباً جماً ويعتنون به اعتناء كبيراً؛ لما يرون على وجهه من النور والخير من حين ولادته . حتى بلغ السادسة من عمره فالتحق بمدرسة الجامع الأحمر ومكث بها فترة ، ثم انتقل أهله للعيش في حي الرجوم وهناك التحق بالمدرسة الثانوية .
ومع بداية الحوادث بين العرب واليهود في نهاية عام 1947م انتقل الشيخ مع عائلته إلى دمشق مروراً بلبنان ، وهناك وجد نفسه مجذوبة نحو الآخرة ، فلازم الجامع الأموي وبدأت رحلته العلمية وهو في سن الثانية عشر ، فتتلمذ وتفقّه على أيدي كبار مشايخ وعلماء دمشق الذين كانوا يتسابقون نحو تربيته ، نذكر منهم : الشيخ عبد الحكيم المنيّر ، والشيخ صالح العقاد ، والشيخ حمدي السفرجلاني ، والشيخ أحمد قويدر العربيني ، والشيخ محمد فايز . فنهل العلم من أهله وطبّقه على نفسه ، حتى كان بعدها في سلوكه فريداً ، وفي جهاده وحيداً .
كانت مدرسته تُعرف بالمدرسة الأخنائية ، وهي تقع في حي الكلاسة شمال الجامع الأموي .
وكان يشغل كل وقته في قراءة فنون الشريعة وآلاتها : مِن قرآن ، وحديث ، وفقه ، وأصول ، وتفسير ، ووعظ وإرشاد ، وتوحيد ، ومنطق ، ونحو ، وصرف ، وبلاغة ، وعلم نفس ، وفلسفة ... إلى غير ذلك . فإذا جَنَّ الليل وقف بين يدي ربه تبارك وتعالى قائلاً : ( إيّاك نعبد وإيّاك نستعين ) .
وقد أجازه الشيخ إبراهيم الغلاييني بالطريقة النقشبندية ، كما أجازه بالطرق الأخرى : كالقادرية ، والجستية ، والكبروية، والسهروردية ، والشيشية.
كان الشيخ منذ نعومة أظفاره مداركاً بالعناية الربانية ، ومحفوظاً من الوقوع في المعاصي وفي الأمور التي تخالف الشريعة قبل التكليف وبعده .
وكان مقدماً عند جميع قرنائه وأصدقائه لرجاحة عقله وشجاعة رأيه ، وقوة ذراعه وشهامته ومروءته ، فكانوا يرجعون إليه دائماً في كل أمورهم حتى مَنْ هو أكبر منه  سناً ، وكانت تُحَلّ بعون الله وبحكمة .
وحين بدأ طريقه في طلب العلم بدأه متوكلاً على الله سبحانه ، واضعاً نصب عينيه هاتين العبارتين : ( مَن لم تكن له بداية محرقة لم تكن له نهاية مشرقة ) ، وكذلك : ( الوقت سيف قاطع إنْ لم تقطعه قطعك ) .
وعلى هذا سلك ، فانقطع عن أهله وترك الدنيا وراء ظهره ، وتجرّد كاملاً لله سبحانه وتعالى ، وانطلق في مجاهدة نفسه وإذلالها وترويضها ، وساح في الجبال والوديان والبراري قاطعاً المسافات الطويلة على قدميه ، متحمّلاً الصعاب الكثيرة ، ومتجاوزاً العقبات الشديدة ، حتى سلك مرحلة ما استطاع غيره أن يسلكها بأربعين عاماً في مجال السلوك والمراقبة ، ووصل في حياة مشايخه إلى درجات رفيعة تجاوزت مراتبهم العلية ، شهدوا له بها وأجازوه بتدريس العلوم الشرعية وتربية المريدين .
ومع هذا كله لم يترك شيخه ساعة ، ولا باستشارة ، ولا بطلب دعاء ، ولا بحُكمِ أمرٍ صغير ولا كبير ، بل كان يرجع إليه في كل أموره ، ويشاوره في كل أحواله ، وكان بين يديه كالعجين بين يدي العجّان ، وكالميت بين يدي المغسِّل ، لا إرادة له ولا كيان . كان المريد الذي يقبّل الأقدام ، ويجلس على الباب وعند النعال ، ويقول : لو متُّ وحَيِيتُ ثم متُّ وحَيِيتُ ألف مرة لبقيت محتاجاً إلى قدم شيخي لألثمه وأتبرك به .
ثم انطلق مبلغاً للدعوة ، فكان يمر على القرى المحيطة بدمشق سيراً على الأقدام ليلاً ونهاراً ، سراً وجهراً ، واضعاً روحه على كفه لا يخشى في الله لومة لائم . وكان يجمع الناس من أماكن اللهو إلى المسجد ، فيقف في الأسواق وعلى أبواب السينما والنوادي والمقاهي يأمر بالمعروف وينهى عن  المنكر ، وقد هدى الله به عدداً كبيراً صاروا مريدين له بعد ذلك .
ثم تولّى الإمامة والخطابة في المساجد ، فاستلم إمامة جامع غل الحليب أولاً ، ثم جامع النحاسين ، ثم استلم جامع المعلق ستة عشر عاماً . كما استلم الخطابة في عدة جوامع منها : جامع الطاووسية في الصالحية ، وجامع الثريا في الميدان ، وجامع الرفاعي بالجزماتية في حي الميدان ، وجامع سوق الهال .... وغيرها . وكانوا يأتونه مِنْ كل المستويات ومِن أماكن قريبة وبعيدة ليسمعوا خطبه المؤثرة والتي كانت تُنقل بالبث المباشر ، بالإضافة إلى أحاديثه الصباحية في الإذاعة . واستطاع بعون الله تعالى إنشاء جيل مؤمن كان ولا يزال له دوره الديني والاجتماعي .
وفي أثناء ذلك تعرّض لأنواع كثيرة من الإغراءات والابتلاءات والفتن ، فصبر وتولّته يد العناية الإلهية . 
علماً بأنَّ الشيخ كذلك قد شارك في مجمع البحوث الإسلامية في القاهرة كعضو من أعضائه لفترة ، وهذا إن دل على شيء فإنما يدل على نشاطه في مجال تبليغ الدعوة في شتى المجالات .
ثم كان تشريفه إلى دبي عام 1973م ، وهناك بدأ مرحلة جديدة تمّم فيه طريقه الذي بدأه في دمشق لإيجاد حياة إسلامية طيبة ، ولتنشئة جيل يسير على درب الصحابة ، مجنّداً جميع وقته وماله ونفسه لذلك .
فقد عاصر مجتمعاً بعيداً عن الإسلام العملي ، يتجاذبه خليط فاسد من الأفكار والمعتقدات والتيارات الغربية ، فقام يبني ويصلح ويقوّم ، ويعالج النفوس المريضة ، ويدافع عن القرآن والسنة وعن المذاهب الأربعة ، ويجمع الناس على حب الله وحب الرسول ، ويبيّن لهم أنَّ الصوفية هي خلاصة العبادة ، وأنَّ الصوفي هو الإنسان الصادق في الدين ، وفي الأخلاق والقيم . فانضم إليه عدد كبير ، وكانت تلك النهضة الروحية الإسلامية العلمية في دبي .
لكن ذلك لم يَرُقْ لأعدائه وخصومه إذ كل ذي نعمة محسود ، فتعرّض لكثير من النعوت والسب والفتن والدعايات الكاذبة ، فصبر كثيراً وهو يقول :

لأَستسهلنّ الصعب أو أُدرك المنى       فما انقادت الآمال إلا لصابر

ولم يزده ذلك إلا رفعة وثباتاً على الحق ، وبقي المربي الواعظ الذي يدل الناس على الطهر الجسمي والروحي .
ولا زال على طريقه الذي بدأه ، ولا زالت المعركة مستمرة والنصر له بإذن الله تعالى ، ومَن تمسّك بحبله في هذ الزمان كان مع السفينة الناجية إن شاء الله تعالى .
قد أدهش الناس بشخصيته ، وحيّر مَن حوله بسلوكه .
لا تراه إلا متهلّلاً باسماً ، لا يتأوّه من ابتلاء ، ولا يشكو أمراً .
لا يتحرّك إلا بحكمة ، ولا يسكن إلا عن حكمة .
إذا تكلّم أثّر كلامه في قلوب سامعيه .
وإذا جلستَ بين يديه عشت زمن السلف الصالح بتواضعه ، وليونته ، وروحه الطيبة ، وبسمته الناعمة ، وكرمه الذي لا حدود له ، موائده لا تُرفع ، وناره لا تُطفأ .
كان ولا زال جامعاً لصفات الرحمة والإنسانية ، وللأخلاق المحمدية التي يشهد بها العدو قبل الصديق ، سراجاً منيراً من جميع الوجوه ، عليه من الهيبة والنور ما يعرفه مَن حضر بين يديه .

أجل ، لقد كان الشيخ ولا يزال البحر الخضم الذي لا يدرك ساحله ، والروض الأنيق الذي تتفتح أزهاره ، معطاء بيده ولسانه وإشاراته وبسمته ، ذكرياته وحوادثه كلها عبر وعظات ، ومهما كتبنا وقلنا فلن نستطيع أن نعطيه حقه ، فجزاه الله عنا وعن المسلمين أفضل وأتم وخير الجزاء .  
وما كانت هذه الأسطر سوى قطوف مختصرة من سيرة الشيخ ، علّها تجدد في المسلمين روح الاتباع والتمسك بالكتاب والسنة ، وليعلم الذين وهنوا أنَّ هذه الأمة ستبقى بعون الله تزهو برجالاتها حتى قيام الساعة .
ومَن أراد الاستفاضة أكثر فيستطيع أن يرجع إلى ترجمته الكاملة في مؤلّف خاص .
كما يستطيع الاطلاع على مؤلفاته المعروفة ، وعلى دروسه وخطبه المسجلة ، والتي فيها من النصائح والفوائد والدرر الكثير .
والله نسأل أن يعرفنا قدر الشيخ ، وأن يكرمنا ببركته لنسير على دربه ، ونسلك السلوك الصحيح ؛ لنكون خير خلف لخير سلف .

وصلى الله وسلم على سيدنا محمد النبي الأمي ، وعلى آله وصحبه وسلم ..
والحمد لله رب العالمين ..


                </p>
            </div>
          </div>
       </div>
    </Layout>
    );
  }
}

export default DefinitionofSheikh;
